/****************************************************************************

Требуется отыскать самый выгодный маршрут между городами. Требуемое время работы O((N+M)logN), где N-количество городов, M-известных дорог между ними.
Оптимизируйте ввод.
N ≤ 10000, M ≤ 250000.
Длина каждой дороги ≤ 10000.

*Формат входных данных*
Первая строка содержит число N – количество городов.
Вторая строка содержит число M - количество дорог.
Каждая следующая строка содержит описание дороги (откуда, куда, время в пути).
Последняя строка содержит маршрут (откуда и куда нужно доехать).

*Формат выходных данных*
Вывести длину самого выгодного маршрута.

 | in   | out |
 |------|-----|
 |6     | 9   |
 |9     |     |
 |0 3 1 |     |
 |0 4 2 |     |
 |1 2 7 |     |
 |1 3 2 |     |
 |1 4 3 |     |
 |1 5 3 |     |
 |2 5 3 |     |
 |3 4 4 |     |
 |3 5 6 |     |
 |0 2   |     |
****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

