/****************************************************************************

Написать алгоритм для решения игры в “пятнашки”. Решением задачи является приведение к виду:
[ 1  2  3  4 ]
[ 5  6  7  8 ]
[ 9  10 11 12]
[ 13 14 15 0 ]
где 0 задает пустую ячейку.

Достаточно найти хотя бы какое-то решение. Число перемещений костяшек не обязано быть минимальным.

*Формат входных данных*
Начальная расстановка. (может быть одной строкой)

*Формат выходных данных*
Если решение существует, то в первой строке выходного файла выведите минимальное число перемещений костяшек, которое нужно сделать, чтобы достичь выигрышной конфигурации, а во второй строке выведите соответствующую последовательность ходов: L означает, что в результате перемещения костяшки пустая ячейка сдвинулась влево, R – вправо, U – вверх, D – вниз. Если таких последовательностей несколько, то выведите любую из них. Если же выигрышная конфигурация недостижима, то выведите в выходной файл одно число −1.

 |   in       | out |
 |------------|-----|
 |1 2 3 4     | 1   |
 |5 6 7 8     | U   |
 |9 10 11 0   |     |
 |13 14 15 12 |     |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

