/****************************************************************************

Задача в контесте - B.
Задан ориентированный граф, каждое ребро которого обладает целочисленной пропускной способностью. Найдите максимальный поток из вершины с номером 1 в вершину с номером 𝑛.

*Формат входного файла*
Первая строка входного файла содержит 𝑛 и 𝑚 — количество вершин и количество ребер графа (2 ≤ 𝑛 ≤ 100, 1 ≤ 𝑚 ≤ 1000). Следующие 𝑚 строк содержат по три числа: номера вершин, которые соединяет соответствующее ребро графа и его пропускную способность. Пропускные способности не превосходят 105.

*Формат выходного файла*
В выходной файл выведите одно число — величину максимального потока из вершины с номером 1 в вершину с номером n.

| in   |out |
|------|----|
|4 5   | 3  |
|1 2 1 |    |
|1 3 2 |    |
|3 2 1 |    |
|2 4 2 |    |
|3 4 1 |    |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

