/****************************************************************************

Задача A в контесте.

Дан неориентированный связный граф. Требуется найти вес минимального остовного дерева в этом графе.
Вариант 1. С помощью алгоритма Прима.
Вариант 2. С помощью алгоритма Крускала.
Вариант 3. С помощью алгоритма Борувки.
Один вариант на всех не брать =)

*Формат входного файла*
Первая строка входного файла содержит два натуральных числа 𝑛 и 𝑚 — количество вершин и ребер графа соответственно (1 ≤ n ≤ 20000, 0 ≤ m ≤ 100000).
Следующие 𝑚 строк содержат описание ребер по одному на строке.
Ребро номер 𝑖 описывается тремя натуральными числами 𝑏𝑖, 𝑒𝑖 и 𝑤𝑖 — номера концов ребра и его вес соответственно (1 ≤ 𝑏𝑖, 𝑒𝑖 ≤ 𝑛, 0 ≤ 𝑤𝑖 ≤ 100000).

*Формат выходного файла*
Выведите единственное целое число - вес минимального остовного дерева.

 | in   | out |
 |------|-----|
 |4 4   | 7   |
 |1 2 1 |     |
 |2 3 2 |     |
 |3 4 5 |     |
 |4 1 4 |     |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

