/****************************************************************************

Дан невзвешенный неориентированный граф. В графе может быть несколько кратчайших путей между какими-то вершинами.
Найдите количество различных кратчайших путей между заданными вершинами. Требуемая сложность O(V+E).

Ввод: v:кол-во вершин(макс. 50000), n:кол-во ребер(макс. 200000), n пар реберных вершин, пара вершин v, w для запроса.
Вывод: количество кратчайших путей от v к w

 | in  | out |
 |-----|-----|
 |4    |  2  |
 |5    |     |
 |0 1  |     |
 |0 2  |     |
 |1 2  |     |
 |1 3  |     |
 |2 3  |     |
 |     |     |
 |0 3  |     |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

