/****************************************************************************

Дан ориентированный граф. Определите, какое минимальное количество ребер необходимо добавить, чтобы граф стал сильносвязным. В графе возможны петли.

*Формат ввода*
В первой строке указывается число вершин графа V, во второй – число ребер E, в последующих – E пар вершин, задающих ребра.

*Формат вывода*
Минимальное число ребер k.


 |  in  | out |
 |------|-----|
 | 4    | 1   |
 | 4    |     |
 | 1 2  |     |
 | 2 3  |     |
 | 3 1  |     |
 | 3 4  |     |

 |  in  | out |
 |------|-----|
 | 5    | 2   |
 | 4    |     |
 | 1 2  |     |
 | 3 4  |     |
 | 4 5  |     |
 | 5 3  |     |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

