/****************************************************************************

Дан невзвешенный неориентированный граф. В графе может быть несколько кратчайших путей между какими-то вершинами.
Найдите цикл минимальной длины. Требуемая сложность O(VE), + 1 балл за O(V + E).

Ввод: В первой строке вводятся два натуральных числа N и M, не превосходящих 10000. Далее идут M строк по 2 числа (от 0 до N-1) - индексы вершин между которыми есть ребро.
Вывод: 1 целое число равное длине минимального цикла. Если цикла нет, то вывести -1.


  in  | out
 -----|-----
  6 6 |  4
  0 1 |
  0 2 |
  2 3 |
  2 4 |
  3 5 |
  4 5 |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

