/****************************************************************************

Дана матрица смежности ориентированного графа. Проверьте, содержит ли граф вершину-сток.
То есть вершину, в которую ведут ребра из всех вершин, и из которой не выходит ни одного ребра. Требуемая сложность O(V).

Ввод: n:размерность матрицы, n строк матрицы.
Вывод: "YES" или "NO"

 |   in   | out |
 |--------|-----|
 |3       | NO  |
 |0 1 1   |     |
 |0 0 1   |     |
 |1 0 0   |     |
 |--------|-----|
 |4       | YES |
 |0 1 0 1 |     |
 |0 0 0 0 |     |
 |1 1 0 0 |     |
 |1 1 0 0 |     |
 |--------|-----|
 |4       | NO  |
 |0 1 0 1 |     |
 |0 0 0 0 |     |
 |1 0 0 0 |     |
 |1 1 0 0 |     |

****************************************************************************/

#include <iostream>

int main()
{
    return 0;
}

